Repository: debug-evac/assembler
Catalog: man/po4a/assembler-format.5.md-*.po
Languages: de

source: SYNOPSIS
de: ÜBERSICHT

source: DESCRIPTION
de: BESCHREIBUNG

source: SEE ALSO
de: SIEHE AUCH

source: ASSEMBLER-FORMAT(5) Version 1.2.0 | File Formats Manual
de: ASSEMBLER-FORMAT(5) Version 1.2.0 | Handbuch für Dateiformate

source: date: February 2024
de: date: Februar 2024

source: **assembler-format** --- format of input assembly files
de: **assembler-format** --- Format von Eingabe-Assemblerdateien

source: ; is a single line comment, you can write everything here .data ; You can use labels here as well as in memory locations LABEL: .byte 1, 2, 3, LABEL ; 8 bit numbers .half 1, 2, 3, LABEL ; 16 bit numbers .word 1, 2, 3, LABEL ; 32 bit numbers .dword 1, 2, 3, LABEL ; 64 bit numbers .eqv CONST, 20 ; CONST is set to 20
de: ; ist ein einzeiliger Kommentar, hier kann alles geschrieben werden .data ; Sie können sowohl hier als auch für Plätze im Speicher Labels verwenden LABEL: .byte 1, 2, 3, LABEL ; 8-Bit-Zahlen .half 1, 2, 3, LABEL ; 16-Bit-Zahlen .word 1, 2, 3, LABEL ; 32-Bit-Zahlen .dword 1, 2, 3, LABEL ; 64-Bit-Zahlen .eqv CONST, 20 ; CONST wird auf 20 gesetzt

source: .text ; You can also use labels here in the .text section ; Write instructions and macros here START: nop addi zero, zero, 0 addi t1, zero, 2 mul t0, sp, t1 LOD: j LOD ; You can use labels in macros
de: .text ; Sie können auch hier im .text-Abschnitt Labels verwenden ; Schreiben Sie Anweisungen und Makros hier hin START: nop addi zero, zero, 0 addi t1, zero, 2 mul t0, sp, t1 LOD: j LOD ; Sie können Labels auch in Makros verwenden

source: The [assembler(1)] command converts assembly files to output in binary or mif format. The syntax is based on MIPS assembly syntax and is modified to lessen programmer burden and increase compatibility to already established tools and conventions.
de: Der Befehl [assembler(1)] konvertiert Assemblerdateien in eine Ausgabe im binären oder MIF-Format. Die Syntax basiert auf der MIPS-Assembler-Syntax und wurde modifiziert, um den Aufwand des Programmierers zu verringern und die Kompatibilität mit bereits etablierten Tools und Konventionen zu erhöhen.

source: In general, every line contains nothing (blanks), a section, a label or a label and operation. Comments can be added to the end of any line or inserted into a line that otherwise would contain nothing (blanks). The assembler is leniant with the placement of these components to eachother. A operation is an instruction, macro or directive.
de: Im Allgemeinen enthält jede Zeile nichts (Leerzeichen), eine Sektion, ein Label oder ein Label und eine Operation. Kommentare können am Ende jeder Zeile hinzugefügt oder in eine Zeile eingefügt werden, die ansonsten nichts (Leerzeichen) enthalten würde. Der Assembler ist nachsichtig mit der Platzierung dieser Komponenten zueinander. Eine Operation ist eine Anweisung, ein Makro oder eine Direktive.

source: A single line:
de: Eine einzelne Zeile:

source: LABEL: <OPERATION> ; COMMENT
de: LABEL: <OPERATION> ; KOMMENTAR

source: Multiple lines that fall into a single line:
de: Mehrere Zeilen, die in einer einzigen Zeile zusammenfasst werden:

source: LABEL: ; COMMENT ; COMMENT
de: LABEL: ; KOMMENTAR ; KOMMENTAR

source: <OPERATION> ; COMMENT
de: <OPERATION> ; KOMMENTAR

source: Similiar to above, but in a different format:
de: Ähnlich wie oben, aber in einem anderen Format:

source: LABEL: ; COMMENT <OPERATION> ; COMMENT ; COMMENT
de: LABEL: ; KOMMENTAR <OPERATION> ; KOMMENTAR ; KOMMENTAR

source: All three examples are equal, if the operations are equal.
de: Alle drei Beispiele sind gleich, wenn die Operationen gleich sind.

source: See [OPERATIONS][] and [LABEL DEFINITIONS][] for details.
de: Siehe [OPERATIONEN][] und [LABEL-DEFINITIONEN][] für Details.

source: TEXT AND DATA SECTIONS
de: TEXT- UND DATENSEKTIONEN

source: Sections are ordered and used to store operations into a particular kind of memory or memory locations. Sections of any kind can only be defined once. Currently only data and text sections are supported with no plans for supporting other sections.
de: Sektionen sind geordnet und werden verwendet, um Operationen, die sich in den Sektionen befinden, einer bestimmten Speicherstelle oder Speicherart zuzuweisen. Sektionen jeglicher Art können nur einmal definiert werden. Derzeit werden nur Daten- und Textsektionen unterstützt ohne Pläne für die Unterstützung anderer Sektionen.

source: The use of sections are optional and a assembly file containing no explicit sections, implicitly defines a text section spanning the whole file.
de: Die Verwendung von Sektionen ist optional, und eine Assemblerdatei, die keine expliziten Sektionen enthält, definiert implizit eine Textsektion, die die gesamte Datei umfasst.

source: Assembly files must contain a text section and optionally can contain a non-empty data section.
de: Assemblerdateien müssen eine Textsektion und optional eine nicht leere Datensektion enthalten.

source: Data sections must come before text sections.
de: Datensektionen müssen vor Textsektionen stehen.

source: Valid assembly file that includes a data and text section:
de: Gültige Assemblerdatei, die eine Datensektion und eine Textsektion enthält:

source: .data ; Outlines a data section spanning to the <DIRECTIVE> ; next text section <DIRECTIVE>
de: .data ; Definiert eine Datensektion, die bis zur nächsten Textsektion reicht <DIREKTIVE> <DIREKTIVE>

source: .text ; Outlines a text section spanning to the <INSTRUCTION> ; end of the file <INSTRUCTION>
de: .text ; Definiert eine Textsektion, die bis zum Ende der Datei reicht <ANWEISUNG> <ANWEISUNG>

source: Valid assembly file that only includes a text section:
de: Gültige Assemblerdatei, die nur eine Textsektion enthält:

source: .text <INSTRUCTION> <INSTRUCTION>
de: .text <ANWEISUNG> <ANWEISUNG>

source: Valid assembly file that implicitly defines a text section:
de: Gültige Assemblerdatei, die implizit eine Textsektion definiert:

source: START: <INSTRUCTION> <INSTRUCTION>
de: START: <ANWEISUNG> <ANWEISUNG>

source: Invalid assembly file since the data section is empty (this may be changed in the future):
de: Ungültige Assemblerdatei, da die Datensektion leer ist (dies kann sich in Zukunft ändern):

source: .data .text <INSTRUCTION>
de: .data .text <ANWEISUNG>

source: Invalid assembly file since it only contains a data section:
de: Ungültige Assemblerdatei, da sie nur eine Datensektion enthält:

source: .data <DIRECTIVE> <DIRECTIVE>
de: .data <DIREKTIVE> <DIREKTIVE>

source: See [DIRECTIVES][], [MACROS][] and [INSTRUCTIONS][] for details.
de: Siehe [DIREKTIVEN][], [MAKROS][] und [ANWEISUNGEN][] für Details.

source: LABEL DEFINITIONS
de: LABEL-DEFINITIONEN

source: Label definitions are label references that are suffixed with a colon. Labels must be at least one character long and can only contain alphanumeric characters. The first character must be alphabetic.
de: Label-Definitionen sind Label-Verweise, die mit einem Doppelpunkt enden. Labels müssen mindestens ein Zeichen lang sein und dürfen nur alphanumerische Zeichen enthalten. Das erste Zeichen muss alphabetisch sein.

source: Correct label definitions include the following:
de: Korrekte Label-Definitionen:

source: Incorrect labels definitions include:
de: Falsche Label-Definitionen:

source: Do note that currently there is no validation of label types and if the label value fits into the instruction. Errors for the former and warnings of the latter are planned.
de: Beachten Sie, dass derzeit keine Validierung der Label-Typen erfolgt und nicht überprüft wird, ob der Label-Wert in die Anweisung passt. Fehler für Ersteres und Warnungen für Letzteres sind geplant.

source: OPERATIONS
de: OPERATIONEN

source: Operations is a definition used to describe instructions, macros and directives. The arguments can be immediates, registers and/or labels. The arguments are separated by commas (**,**) or commas with a space (**,** ). The operation name and arguments are separated by one or more spaces.
de: Anweisungen, Makros und Direktiven werden unter dem Oberbegriff Operationen zusammengefasst. Die Argumente können Immediates, Register und/oder Labels sein. Die Argumente sind durch Kommas (**,**) oder Kommas mit einem Leerzeichen (**,** ) getrennt. Der Operationsname und die Argumente sind durch ein oder mehrere Leerzeichen getrennt.

source: See [INSTRUCTIONS][], [DIRECTIVES][] and [MACROS][] for details.
de: Siehe [ANWEISUNGEN][], [DIREKTIVEN][] und [MAKROS][] für Details.

source: REGISTERS
de: REGISTER

source: Some instructions and macros require registers to perform actions. There are 31 registers that can be used. Registers can be referenced by either the register number prefixed with an **x**, meaning **x0** to **x31**, or their ABI name.
de: Einige Anweisungen und Makros erfordern Register, um Aktionen auszuführen. Es gibt 31 Register, die verwendet werden können. Register können entweder durch die Registernummer mit einem vorangestellten **x**, was **x0** bis **x31** bedeutet, oder durch ihren ABI-Namen referenziert werden.

source: | Register | ABI Name | Description | Saver | |:-------------------:|:-------------------:|-----------------------------------------------------------------------------------------------|:--------:| | x0 | zero | Immutable register that is always zero. | — | | x1 | ra | Return address | Callee | | x2 | sp | Stack pointer | Callee | | x3 | gp | General purpose register. Global pointer according to RISC-V spec, but not used as such here. | — | | x4 | tp | General pupose register. Thread pointer according to RISC-V spec, but not used as such here. | — | | x5-x7 | t0-t2 | Temporary register. | Caller | | x8 | s0/fp | Saved register or frame pointer. | Callee | | x9 | s1 | Saved register. | Callee | | x10-x11 | a0-a1 | Register for return values and function arguments. | Caller | | x12-x17 | a2-a7 | Register for function arguments. | Caller | | x18-x27 | s2-s11 | Saved register. | Callee | | x28-x31 | t3-t6 | Temporary register. | Caller |
de: | Register | ABI Name | Beschreibung | Saver | |:-------------------:|:-------------------:|------------------------------------------------------------------------------------------------------|:--------:| | x0 | zero | Unveränderbares Register, das immer Null ist. | — | | x1 | ra | Rücksprungadresse | Callee | | x2 | sp | Stack-Pointer | Callee | | x3 | gp | Allzweckregister. Globaler Pointer gemäß RISC-V-Spezifikation, aber hier nicht als solches verwendet.| — | | x4 | tp | Allzweckregister. Thread-Pointer gemäß RISC-V-Spezifikation, aber hier nicht als solches verwendet. | — | | x5-x7 | t0-t2 | Temporäres Register. | Caller | | x8 | s0/fp | Gespeichertes Register oder Frame-Pointer. | Callee | | x9 | s1 | Gespeichertes Register. | Callee | | x10-x11 | a0-a1 | Register für Rückgabewerte und Funktionsargumente. | Caller | | x12-x17 | a2-a7 | Register für Funktionsargumente. | Caller | | x18-x27 | s2-s11 | Gespeichertes Register. | Callee | | x28-x31 | t3-t6 | Temporäres Register. | Caller |

source: Some instructions, macros and directives require immediates to perform actions. Immediates are either in decimal, binary or hexadecimal format. By default the decimal format is assumed. To interpret immediates as binary or hexadecimal, the prefix **0b** and **0x** must be used respectively. Optionally binary or hexadecimal can be interpreted as signed numbers by suffixing the immediate with **s** or **S**.
de: Einige Anweisungen, Makros und Direktiven erfordern Immediates, um Aktionen auszuführen. Immediates sind entweder als Dezimal-, Binär- oder Hexadezimalzahl formatiert. Standardmäßig wird das Dezimalformat angenommen. Um Immediates als binär oder hexadezimal zu interpretieren, muss das Präfix **0b** bzw. **0x** verwendet werden. Optional können binäre oder hexadezimale Immediates als vorzeichenbehaftete Zahlen interpretiert werden, indem ein **s** oder **S** als Suffix hinzugefügt wird.

source: The following immediates are valid:
de: Die folgenden Immediates sind gültig:

source: The following immediates are invalid:
de: Die folgenden Immediates sind ungültig:

source: 0.1 ; floating point not supported (yet) b100 x1516 02x3 50-20 ; expressions are not supported
de: 0.1 ; Gleitkommazahlen werden (noch) nicht unterstützt b100 x1516 02x3 50-20 ; Ausdrücke werden nicht unterstützt

source: DIRECTIVES
de: DIREKTIVEN

source: Directives are used in data sections and always prefixed with a dot (**.**). Some common directives are supported and mainly the ones that can be used to store data in the data section.
de: Direktiven werden in Datensektionen verwendet und sind immer mit einem Punkt (**.**) vorangestellt. Einige häufig verwendete Direktiven werden unterstützt, hauptsächlich solche, die zur Speicherung von Daten in der Datensektion verwendet werden.

source: For some directives the argument is a string, which is delimited by quotation marks. Otherwise general rules apply here as well.
de: Für einige Direktiven ist das Argument ein String, der zwischen Anführungszeichen steht. Ansonsten gelten hier die Konventionen, die generell gelten.

source: The order of the directives in the assembly file dictate the order of the data in memory. Data starts at address 0 and grows upwards. The first directive is written to address 0.
de: Die Reihenfolge der Direktiven in der Assemblerdatei bestimmt die Reihenfolge der Daten im Speicher. Daten beginnen bei Adresse 0 und wachsen nach oben. Die erste Direktive wird an Adresse 0 geschrieben.

source: Currently the following directives are supported:
de: Derzeit werden die folgenden Direktiven unterstützt:

source: : The immediates and labels are stored as 8 bit values in memory.
de: : Die Immediates und Label werden als 8-Bit-Werte im Speicher gespeichert.

source: : The immediates and labels are stored as 16 bit values in memory.
de: : Die Immediates und Label werden als 16-Bit-Werte im Speicher gespeichert.

source: : The immediates and labels are stored as 32 bit values in memory.
de: : Die Immediates und Label werden als 32-Bit-Werte im Speicher gespeichert.

source: : The immediates and labels are stored as 64 bit values in memory.
de: : Die Immediates und Label werden als 64-Bit-Werte im Speicher gespeichert.

source: **.space** *decimal*
de: **.space** *dezimal*

source: : Reserve space for data. The *decimal* denotes the space reserved in bytes. It must be a decimal and cannot be negative.
de: : Reserviere Platz für Daten. Die *Dezimal*zahl gibt den reservierten Platz in Bytes an. Es muss eine Dezimalzahl sein und kann nicht negativ sein.

source: : The *string* is stored as consecutive 8 bit values. The *string* should only contain ASCII characters. All characters are translated to their ASCII code. The *string* is not null terminated.
de: : Der *string* wird als aufeinanderfolgende 8-Bit-Werte gespeichert. Der *string* sollte nur ASCII-Zeichen enthalten. Alle Zeichen werden in ihren ASCII-Code übersetzt. Der *string* ist nicht nullterminiert.

source: : Same as **.ascii** but the *string* is null terminated.
de: : Wie **.ascii**, aber der *string* ist nullterminiert.

source: : Alias for **.asciz**.
de: : Alias für **.asciz**.

source: : The value of the *label* is *immediate*. A *label* emitted this way is a constant that is not written in memory and can be used like a immediate.
de: : Der Wert des *label*s ist gleich *immediate*. Ein auf diese Weise erstelltes *label* ist eine Konstante, die nicht in den Speicher geschrieben wird und wie ein Immediate verwendet werden kann.

source: These are valid directives:
de: Diese sind gültige Direktiven:

source: These are invalid directives:
de: Diese sind ungültige Direktiven:

source: .non ; unknown directive .byte ; no arguments .half 30 15 .space 0b10 ; argument can only be decimal .asciz "STRING ; missing closing quotation mark
de: .non ; unbekannte Direktive .byte ; keine Argumente .half 30 15 .space 0b10 ; Argument kann nur eine Dezimalzahl sein .asciz "STRING ; fehlendes abschließendes Anführungszeichen

source: MACROS
de: MAKROS

source: Macros are pseudo-instructions that are not and cannot be translated to machine code as is. The syntax is similiar to [INSTRUCTIONS][]. Some of the common macros are supported.
de: Makros sind Pseudo-Anweisungen, die nicht direkt in Maschinencode übersetzt werden können. Die Syntax ist ähnlich wie bei [ANWEISUNGEN][]. Einige der gängigen Makros werden unterstützt.

source: Macros are expanded and mapped to instructions that are machine translatable. Macros cannot be defined by programmers.
de: Makros werden erweitert und auf Anweisungen abgebildet, die zu Maschinencode übersetzbar sind. Makros können nicht von Programmierern definiert werden.

source: The first register for macros that have them is always the register that is written to.
de: Das erste Register für Makros (die welche haben) ist immer das Register, in das geschrieben wird.

source: Currently the following macros are supported:
de: Derzeit werden die folgenden Makros unterstützt:

source: : Shift right rotate. This is implemented as a subroutine thus saving registers is required. Saving registers is not done automatically!
de: : Shift right rotate (Bitweise rechts rotieren). Dies ist als Unterprogramm implementiert, daher ist das Speichern von Registern erforderlich. Das Speichern von Registern erfolgt nicht automatisch!

source: : Shift left rotate. This is implemented as a subroutine thus saving registers is required. Saving registers is not done automatically!
de: : Shift left rotate (Bitweise links rotieren). Dies ist als Unterprogramm implementiert, daher ist das Speichern von Registern erforderlich. Das Speichern von Registern erfolgt nicht automatisch!

source: : Load immediate. *register* is set to the *immediate* or *label*.
de: : Load immediate (Lade den Immediate). *register* wird auf das *immediate* oder *label* gesetzt.

source: : Load address. *register* is set to either the *immediate* or the address of the *label*.
de: : Load address (Lade die Speicheradresse). *register* wird entweder auf das *immediate* oder auf die Adresse des *label* gesetzt.

source: : Jump to a far-away label and handle it as a subroutine. The return address is written to register **ra**. Returning is possible by using the macro **ret** or by the equivalent **jal** instruction.
de: : Springt zu einem weit entfernten *Label* und behandelt es als Unterprogramm. Die Rücksprungadresse wird in das Register **ra** geschrieben. Ein Rücksprung ist mithilfe des Makros **ret** oder der entsprechenden **jal**-Anweisung möglich.

source: : Jump to a far-away label. The return address is voided. Returning is not possible.
de: : Springt zu einem weit entfernten *Label*. Die Rücksprungadresse wird nicht gespeichert. Ein Rücksprung ist nicht möglich.

source: : Save the content of these registers onto the stack. Requires initialization of the stack pointer register **sp**. Multiple registers can be specified to reduce the subtraction overhead. The registers are saved in the given order. The first register is saved at the bottom, the last register at the top of stack.
de: : Speichert den Inhalt dieser Register auf dem Stack. Die Initialisierung des Stack-Pointer-Registers **sp** ist erforderlich. Es können mehrere Register angegeben werden, um nur eine Subtraktion auszuführen. Die Register werden in der angegebenen Reihenfolge gespeichert. Das erste Register wird am Ende und das letzte Register am Anfang des Stacks gespeichert.

source: : Load the content of the stack into the registers. Requires initialization of the stack pointer register **sp**. Multiple registers can be specified to reduce the addition overhead. The content is loaded into the registers in the given order. The first register receives the content of the top of stack, the last register of the bottom.
de: : Lädt den Inhalt des Stacks in die Register. Die Initialisierung des Stack-Pointer-Registers **sp** ist erforderlich. Es können mehrere Register angegeben werden, um nur eine Addition auszuführen. Der Inhalt wird in den Registern in der angegebenen Reihenfolge geladen. Das erste Register erhält den Inhalt des ersten Elementes auf dem Stack. Das letzte Register erhält den Inhalt des n-ten Elementes, welches sich ausgehend von dem Anfang des Stacks auf dem Stack befindet. N steht für die Anzahl der Register, die bei der Anweisung angegeben wurde.

source: **rep** *decimal*, *instruction*|*macro*
de: **rep** *dezimal*, *Anweisung*|*Makro*

source: : Repeat the *instruction* or *macro* *decimal* times. The decimal must be greater than 0. Repeats cannot be nested, meaning a repeat cannot contain a repeat.
de: : Die *Anweisung* oder *Makro* wird *dezimal* mal wiederholt. Die Dezimalzahl muss größer als 0 sein. Wiederholungen können nicht verschachtelt werden, d. h. eine Wiederholung kann keine weitere Wiederholung enthalten.

source: : Copies the content of the latter register into the former register. This is mapped to either the instruction **addi** or **add**.
de: : Kopiert den Inhalt des letzten Registers in das erste Register. Dies wird entweder auf die Anweisung **addi** oder **add** abgebildet.

source: : No operation. It does not do anything other than incrementing the program counter by 4 and use processing cycles. This is mapped to either the instruction **addi zero, zero, 0** or **add zero, zero, zero**.
de: : Nulloperation. Die Operation inkrementiert nur den Programmzähler um 4 und nutzt Prozessorzyklen. Dies wird entweder auf die Anweisung **addi zero, zero, 0** oder **add zero, zero, zero** abgebildet.

source: : Used to return from a subroutine. This is mapped to the instruction **jalr zero, ra, 0**.
de: : Wird verwendet, um aus einem Unterprogramm zurückzukehren. Dies wird auf die Anweisung **jalr zero, ra, 0** abgebildet.

source: : Jump to the *label* or *immediate*. This is mapped to the instruction **jal zero,** *offset*.
de: : Springt zum *Label* oder *Immediate*. Dies wird auf die Anweisung **jal zero,** *offset* abgebildet.

source: : Jump and link to the *label* or *immediate*. This is mapped to the instruction **jal ra,** *offset*.
de: : "Jump and Link" (Springt zu einer Subroutine und speichert die Rücksprungadresse) mit dem *label* oder *immediate*. Dies wird auf die Anweisung **jal ra,** *offset* abgebildet.

source: : Jump to the address in the *register*. This is mapped to the instruction **jalr zero,** *register***, 0**.
de: : Springt zur Adresse im *Register*. Dies wird auf die Anweisung **jalr zero,** *register***, 0** abgebildet.

source: : Jump and link to the address in the *register*. This is mapped to the instruction **jalr ra,** *register***, 0**.
de: : "Jump and Link Register" (Springt zu einer Subroutine, dessen Adresse im *Register* steht, und speichert die Rücksprungadresse) mit der Adresse im Register **ra**. Dies wird auf die Anweisung **jalr ra,** *register***, 0** abgebildet.

source: See [RISC-V Shortened Spec][] for details.
de: Siehe [RISC-V Shortened Spec][] für weitere Details.

source: INSTRUCTIONS
de: ANWEISUNGEN

source: An instruction is machine code in human-readable form. The syntax is similiar to [MACROS][]. All instructions of the RV32I and RV32M extensions are supported.
de: Eine Anweisung ist Maschinencode in lesbarer Form. Die Syntax ähnelt der von [MAKROS][]. Alle Anweisungen der RV32I- und RV32M-Erweiterungen werden unterstützt.

source: The first register for instructions that have them is always the register that is written to. A limitation to that rule are branch instructions.
de: Bei Anweisungen, auf die das zutrifft, ist das erste Register immer das Register, in das geschrieben wird. Eine Ausnahme dazu bilden Sprunganweisungen.

source: These instructions are used to perform arithmetical, logical and shift operations with registers:
de: Diese Anweisungen werden verwendet, um arithmetische, logische und Schiebeoperationen mit Registern durchzuführen:
