Repository: debug-evac/assembler
Catalog: man/po4a/assembler-format.5.md-*.po
Languages: de

source: : Addition of the two latter *register*s.
de: : Addition der beiden letzten *Register*.

source: : Subtraction. The minuend is the content of the second *register*, the subtrahend is the content of the last *register*.
de: : Subtraktion. Der Minuend ist der Inhalt des zweiten *Register*s, der Subtrahend ist der Inhalt des letzten *Register*s.

source: : Logical bitwise exclusive or of the second and third *register*.
de: : Logisches bitweises exklusives Oder des zweiten und dritten *Register*s.

source: : Logical bitwise or of the second and third *register*.
de: : Logisches bitweises Oder des zweiten und dritten *Register*s.

source: : Logical bitwise and of the second and third *register*.
de: : Logisches bitweises Und des zweiten und dritten *Register*s.

source: : Logical left shift of the second *register* by the third *register*.
de: : Logisches Linksschieben des zweiten *Register*s um das dritte *Register*.

source: : Logical right shift of the second *register* by the third *register*.
de: : Logisches Rechtsschieben des zweiten *Register*s um das dritte *Register*.

source: : Arithmetical right shift of the second *register* by the third *register*.
de: : Arithmetisches Rechtsschieben des zweiten *Register*s um das dritte *Register*.

source: : The first *register* is set to one (1), if the second *register* is less than the last *register*.
de: : Das erste *Register* wird auf eins (1) gesetzt, wenn das zweite *Register* kleiner als das letzte *Register* ist.

source: : The first *register* is set to one (1), if the second *register* is less than the last *register*. The content of the *register*s compared are interpreted as unsigned numbers.
de: : Das erste *Register* wird auf eins (1) gesetzt, wenn das zweite *Register* kleiner als das letzte *Register* ist. Die Inhalte der verglichenen *Register* werden als vorzeichenlose Zahlen interpretiert.

source: : Logical bitwise negated exclusive or of the second and third *register*. Note that this is not defined in the RISC-V standard.
de: : Logisches bitweises negiertes exklusives Oder des zweiten und dritten *Register*s. Dies ist nicht im RISC-V-Standard definiert.

source: : Compares the second and third *register*s and sets the first *register* to one (1), if they are equal. Note that this is not defined in the RISC-V standard.
de: : Vergleicht das zweite und dritte *Register* und setzt das erste *Register* auf eins (1), wenn sie gleich sind. Dies ist nicht im RISC-V-Standard definiert.

source: : Multiplication of the second and third *register*. The first *register* is set to the lower 32 bits of the result.
de: : Multiplikation des zweiten und dritten *Register*s. Das erste *Register* wird auf die unteren 32 Bits des Ergebnisses gesetzt.

source: : High Multiplication of the second and third *register*. The first *register* is set to the higher 32 bits of the result. The content of both *register*s is interpreted as signed numbers.
de: : Hohe Multiplikation des zweiten und dritten *Register*s. Das erste *Register* wird auf die oberen 32 Bits des Ergebnisses gesetzt. Die Inhalte beider *Register* werden als vorzeichenbehaftete Zahlen interpretiert.

source: : High Multiplication of the second and third *register*. The first *register* is set to the higher 32 bits of the result. The content of both *register*s is interpreted as unsigned numbers.
de: : Hohe Multiplikation des zweiten und dritten *Register*s. Das erste *Register* wird auf die oberen 32 Bits des Ergebnisses gesetzt. Die Inhalte beider *Register* werden als vorzeichenlose Zahlen interpretiert.

source: : High Multiplication of the second and third *register*. The first *register* is set to the higher 32 bits of the result. The content of the second *register* is interpreted as a signed number, the content of the third *register* is interpreted as a unsigned number.
de: : Hohe Multiplikation des zweiten und dritten *Register*s. Das erste *Register* wird auf die oberen 32 Bits des Ergebnisses gesetzt. Der Inhalt des zweiten *Register*s wird als vorzeichenbehaftete Zahl interpretiert, der Inhalt des dritten *Register*s als vorzeichenlose Zahl.

source: : Division of the second and third *register*s. The second *register* is the dividend and the third *register* is the divisor. The content of both *register*s are interpreted as signed numbers.
de: : Division des zweiten und dritten *Register*s. Das zweite *Register* ist der Dividend und das dritte *Register* ist der Divisor. Der Inhalt beider *Register* wird als vorzeichenbehaftete Zahlen interpretiert.

source: : Division of the second and third *register*s. The second *register* is the dividend and the third *register* is the divisor. The content of both *register*s are interpreted as unsigned numbers.
de: : Division des zweiten und dritten *Register*s. Das zweite *Register* ist der Dividend und das dritte *Register* ist der Divisor. Der Inhalt beider *Register* wird als vorzeichenlose Zahlen interpretiert.

source: : Modulo operation of the second and third *register*s. The second *register* is the dividend and the third *register* is the divisor. The content of both *register*s are interpreted as signed numbers.
de: : Modulo-Operation des zweiten und dritten *Register*s. Das zweite *Register* ist der Dividend und das dritte *Register* ist der Divisor. Der Inhalt beider *Register* wird als vorzeichenbehaftete Zahlen interpretiert.

source: : Modulo operation of the second and third *register*s. The second *register* is the dividend and the third *register* is the divisor. The content of both *register*s are interpreted as unsigned numbers.
de: : Modulo-Operation des zweiten und dritten *Register*s. Das zweite *Register* ist der Dividend und das dritte *Register* ist der Divisor. Der Inhalt beider *Register* wird als vorzeichenlose Zahlen interpretiert.

source: These instructions are used to perform arithmetical, logical and shift operations with immediates:
de: Diese Anweisungen werden verwendet, um arithmetische, logische und Schiebeoperationen mit Immediates durchzuführen:

source: Shift operations can only take 4 bit immediates.
de: Schiebeoperationen können nur Immediatewerte von 4 Bits verwenden.

source: Note that some instructions cannot use labels. This is WIP.
de: Beachten Sie, dass in einigen Anweisungen keine Labels verwenden werden können. Dies befindet sich in Arbeit und wird zukünftig geändert.

source: : Addition of the second *register* and the *immediate* or *label*.
de: : Addition des zweiten *Register*s und des *Immediate*s oder *Label*s.

source: : Logical bitwise exclusive or of the second *register* and the *immediate*.
de: : Logisches bitweises exklusives Oder des zweiten *Register*s und des *Immediate*s.

source: : Logical bitwise or of the second *register* and the *immediate*.
de: : Logisches bitweises Oder des zweiten *Register*s und des *Immediate*s.

source: : Logical bitwise and of the second *register* and the *immediate*.
de: : Logisches bitweises Und des zweiten *Register*s und des *Immediate*s.

source: : Logical left shift of the second *register* by the *immediate* or *label*.
de: : Logisches Linksschieben des zweiten *Register*s um die *Immediate* oder den Wert des *Label*s.

source: : Logical right shift of the second *register* by the *immediate* or *label*.
de: : Logisches Rechtsschieben des zweiten *Register*s um die *Immediate* oder den Wert des *Label*s.

source: : Arithmetical right shift of the second *register* by the *immediate* or *label*.
de: : Arithmetisches Rechtsschieben des zweiten *Register*s um die *Immediate* oder den Wert des *Label*s.

source: : The first *register* is set to one (1), if the second *register* is less than the *immediate*.
de: : Das erste *Register* wird auf eins (1) gesetzt, wenn das zweite *Register* kleiner als die *Immediate* ist.

source: : The first *register* is set to one (1), if the second *register* is less than the *immediate*. The content of the *register*s compared are interpreted as unsigned numbers.
de: : Das erste *Register* wird auf eins (1) gesetzt, wenn das zweite *Register* kleiner als die *Immediate* ist. Die Inhalte der verglichenen *Register* werden als vorzeichenlose Zahlen interpretiert.

source: These instructions are used to manipulate memory content:
de: Diese Anweisungen werden verwendet, um den Speicherinhalt zu manipulieren:

source: The target byte and half are always the LSBs of the target register.
de: Das Zielbyte und das halbe Wort sind immer die LSBs (niederwertigsten Bits) des Zielregisters.

source: : Loads a byte from memory at the address which is the sum of the second *register* and the *immediate* or *label*.
de: : Lädt ein Byte aus dem Speicher an der Adresse, die die Summe aus dem Inhalt des zweiten *Register*s und der *Immediate* oder dem Wert des *Label*s ist.

source: : Loads a half (16 bits) from memory at the address which is the sum of the second *register* and the *immediate* or *label*.
de: : Lädt ein halbes Wort (16 Bit) aus dem Speicher an der Adresse, die die Summe aus dem Inhalt des zweiten *Register*s und der *Immediate* oder dem Wert des *Label*s ist.

source: : Loads a word (32 bits) from memory at the address which is the sum of the second *register* and the *immediate* or *label*.
de: : Lädt ein Wort (32 Bit) aus dem Speicher an der Adresse, die die Summe aus dem Inhalt des zweiten *Register*s und der *Immediate* oder dem Wert des *Label*s ist.

source: : Loads a byte from memory at the address which is the sum of the second *register* and the *immediate* or *label*. The byte is zero extended to 32 bits.
de: : Lädt ein Byte aus dem Speicher an der Adresse, die die Summe aus dem Inhalt des zweiten *Register*s und der *Immediate* oder dem Wert des *Label*s ist. Das Byte wird auf 32 Bits mit Nullen vorzeichenlos erweitert.

source: : Loads a half from memory at the address which is the sum of the second *register* and the *immediate* or *label*. The half is zero extended to 32 bits.
de: : Lädt ein halbes Wort (16 Bit) aus dem Speicher an der Adresse, die die Summe aus dem Inhalt des zweiten *Register*s und der *Immediate* oder dem Wert des *Label*s ist. Das halbe Wort wird auf 32 Bits mit Nullen vorzeichenlos erweitert.

source: : Stores a byte into memory at the address which is the sum of the second *register* and the *immediate* or *label*.
de: : Speichert ein Byte in den Speicher an der Adresse, die die Summe aus dem Inhalt des zweiten *Register*s und der *Immediate* oder dem Wert des *Label*s ist.

source: : Stores a half into memory at the address which is the sum of the second *register* and the *immediate* or *label*.
de: : Speichert ein halbes Wort in den Speicher an der Adresse, die die Summe aus dem Inhalt des zweiten *Register*s und der *Immediate* oder dem Wert des *Label*s ist.

source: : Stores a word into memory at the address which is the sum of the second *register* and the *immediate* or *label*.
de: : Speichert ein Wort in den Speicher an der Adresse, die die Summe aus dem Inhalt des zweiten *Register*s und der *Immediate* oder dem Wert des *Label*s ist.

source: These instructions are used to control the logic flow of the program:
de: Diese Anweisungen werden verwendet, um den Kontrollfluss des Programms zu steuern:

source: PC-Relative addressing is used for all instructions but **jalr**. For **jalr** absolute addressing is used.
de: Für alle Anweisungen außer **jalr** wird eine PC-relative Adressierung verwendet. Für **jalr** wird absolute Adressierung verwendet.

source: : Branch if the *register*s are equal.
de: : Springt, wenn der Inhalt der *Register* gleich ist.

source: : Branch if the *register*s are not equal.
de: : Springt, wenn der Inhalt der *Register* nicht gleich ist.

source: : Branch if the content of the first *register* is less than the content of the last *register*. The content of the *register*s are interpreted as signed numbers.
de: : Springt, wenn der Inhalt des ersten *Register*s kleiner ist als der Inhalt des letzten *Register*s. Der Inhalt der *Register* wird als vorzeichenbehaftete Zahlen interpretiert.

source: : Branch if the content of the first *register* is less than the content of the last *register*. The content of the *register*s are interpreted as unsigned numbers.
de: : Springt, wenn der Inhalt des ersten *Register*s kleiner ist als der Inhalt des letzten *Register*s. Der Inhalt der *Register* wird als vorzeichenlose Zahlen interpretiert.

source: : Branch if the content of the first *register* is greater than or equal to the content of the last *register*. The content of the *register*s are interpreted as signed numbers.
de: : Springt, wenn der Inhalt des ersten *Register*s größer oder gleich dem Inhalt des letzten *Register*s ist. Der Inhalt der *Register* wird als vorzeichenbehaftete Zahlen interpretiert.

source: : Branch if the content of the first *register* is greater than or equal to the content of the last *register*. The content of the *register*s are interpreted as unsigned numbers.
de: : Springt, wenn der Inhalt des ersten *Register*s größer oder gleich dem Inhalt des letzten *Register*s ist. Der Inhalt der *Register* wird als vorzeichenlose Zahlen interpretiert.

source: : Jump and link to the address which is the sum of the program counter and the *immediate* or *label*. The return address is written to the *register*.
de: : "Jump and link" (Springt zu einer Subroutine und speichert die Rücksprungadresse) zu der Adresse, die die Summe aus dem Programmzähler und der *Immediate* oder dem Wert des *Label*s ist. Die Rücksprungadresse wird in das *Register* geschrieben.

source: : Jump and link to the address which is the sum of the second *register* and the *immediate* or *label*. The return address is written to the first *register*.
de: : "Jump and link register" (Springt zu einer Subroutine und speichert die Rücksprungadresse) zu der Adresse, die die Summe aus dem Inhalt des zweiten *Register*s und der *Immediate* oder dem Wert des *Label*s ist. Die Rücksprungadresse wird in das erste *Register* geschrieben.

source: These instructions cannot be categorized:
de: Diese Anweisungen können nicht kategorisiert werden:

source: : Load upper immediate. The upper 20 bits of the *register* is set to the *immediate* or *label*. The lower 12 bits are zero.
de: : Lädt den oberen Teil des *Immediate*s. Die oberen 20 Bits des *Register*s werden auf das *Immediate* oder *Label* gesetzt. Die unteren 12 Bits sind Nullen.

source: : Add upper immediate to program counter. The upper 20 bits of the *immediate* or *label* is added to the program counter and the result is written to the *register*.
de: : Addiert den oberen Teil des *Immediate* auf den Programmzähler. Die oberen 20 Bits des *Immediate*s oder *Label*s werden zum Programmzähler addiert und das Ergebnis wird in das *Register* geschrieben.

source: [MACROS]: #macros
de: [MAKROS]: #makros

source: [LABEL DEFINITIONS]: #label-definitions
de: [LABEL-DEFINITIONEN]: #label-definitionen

source: [OPERATIONS]: #operations
de: [OPERATIONEN]: #operationen

source: [DIRECTIVES]: #directives
de: [DIREKTIVEN]: #direktiven

source: [INSTRUCTIONS]: #instructions
de: [ANWEISUNGEN]: #anweisungen
