Repository: debug-evac/assembler
Catalog: man/po4a/assembler.1.md-*.po
Languages: de

source: ASSEMBLER(1) Version 2.0.0 | General Commands Manual
de: ASSEMBLER(1) Version 2.0.0 | Handbuch für generelle Befehle

source: date: May 2024
de: date: März 2024

source: **assembler** --- assemble code to self-written RISC-V based CPU
de: **assembler** --- assembliert Code für eine selbst geschriebene auf RISC-V basierende CPU

source: SYNOPSIS
de: ÜBERSICHT

source: **assembler** [*OPTIONS*...] **\-\-input** *file*...\ **assembler -i**|**\-\-input** *file*...\ **assembler -i**|**\-\-input** *file*... [**-o**|**\-\-output** *file*]\ **assembler -i**|**\-\-input** *file*... [**-f**|**\-\-format** [**mif**|**raw**]]\ **assembler -i**|**\-\-input** *file*... [**-f**|**\-\-format mif**] [**-c**]
de: **assembler** [*OPTIONS*...] **\-\-input** *Datei*...\ **assembler -i**|**\-\-input** *Datei*...\ **assembler -i**|**\-\-input** *Datei*... [**-o**|**\-\-output** *Datei*]\ **assembler -i**|**\-\-input** *Datei*... [**-f**|**\-\-format** [**mif**|**raw**]]\ **assembler -i**|**\-\-input** *Datei*... [**-f**|**\-\-format mif**] [**-c**]

source: DESCRIPTION
de: BESCHREIBUNG

source: **Assembler** translates assembly code to machine code for a self-written RISC-V based CPU. [assembler-format(5)][] is based on a modified MIPS syntax that includes instructions and macros from RISC-V, especially RV32I and RV32M.
de: **Assembler** übersetzt Assemblerdateien in Maschinencode für eine selbst geschriebene CPU, die auf RISC-V basiert. [assembler-format(5)][] basiert auf einer modifizierten MIPS-Syntax, die Anweisungen und Makros aus RISC-V enthält, insbesondere RV32I und RV32M.

source: By default, **assembler** translates one or more input *file*s to binary or MIF output files. The **-f** or **\-\-format** option dictates which format should be used for the output. The output is either binary (**raw**) or MIF in accordance to [src_mif(5)][] (**mif**). The MIF format is used by default. Output files are named after and written to the same directory as input *file*s.
de: Standardmäßig übersetzt der **Assembler** eine oder mehrere Eingabedateien (*file*s) in binäre oder MIF-Ausgabedateien. Die Option **-f** oder **\-\-format** gibt an, welches Format für die Ausgabe verwendet werden soll. Die Ausgabe erfolgt entweder binär (**raw**) oder im MIF-Format gemäß [src_mif(5)][] (**mif**). Standardmäßig wird das MIF-Format verwendet. Ausgabedateien werden nach den Eingabedateien benannt und im selben Verzeichnis wie diese geschrieben.

source: The **-t** or **\-\-text-output** and **-d** or **\-\-data-output** options change the directory and file name of the text and data output file respectively. If the input files contain .data sections, a second output *file* is generated that contains the data.
de: Die Optionen **-t** oder **\-\-text-output** und **-d** oder **\-\-data-output** ändern das Verzeichnis und den Dateinamen der Ausgabedateien respektive für die Code und Datenausgabe. Wenn die Eingabedateien .data-Abschnitte enthalten, wird eine zweite Ausgabedatei generiert, die die Daten enthält.

source: The option **\-\-stdout** can be used to print the output to [stdout(3)][]. Pipes and redirections of [stdout(3)][] are also detected and will print the output to [stdout(3)][].
de: Die Option **\-\-stdout** kann dazu verwendet werden, um die Ausgabe über [stdout(3)][] auf die Konsole auszugeben. Pipes und Umleitungen von [stdout(3)][] werden auch erkannt und die Ausgabe wird automatisch über [stdout(3)][] ausgeben.

source: DISCLAIMER: The column for parser errors is incorrect. For most errors, you can assume that the error is at the end of the line. Make sure to use [assembler-format(5)][] correctly. If you have issues, you may open an issue in our repository with sufficient details.
de: DISCLAIMER: Die Spalt für Parserfehler is nicht korrekt. Für die meisten Fehler können Sie davon ausgehen, dass sich dieser am Ende der Zeile befindet. Stellen Sie sicher, dass Sie [assembler-format(5)][] korrekt verwenden. Bei Problemen können Sie sich mit einem Ticket in unserer Repository an uns wenden. Bitte stellen Sie Ihr Problem mit ausreichenden Informationen dar, damit wir Ihnen schnell weiterhelfen können.

source: FILES
de: DATEIEN

source: The **assembler** command expects input to be valid [assembler-format(5)][] code. Source files are normally named *name*.asm (ex. **example.asm**).
de: Der Befehl **assembler** erwartet, dass die Eingabe gültiger Code im [assembler- format(5)][] ist. Quelldateien haben normalerweise den Namen *name*.asm (z. B. **example.asm**).

source: Source files must be in ASCII or UTF-8 encoding. Other encodings have not been tested and may not work.
de: Quelldateien müssen im ASCII- oder UTF-8-Format vorliegen. Andere Codierungen wurden nicht getestet und funktionieren möglicherweise nicht.

source: When assembling output files, destination filenames are **a.***ext* for text output and **a.mem.***ext* for data output or the paths specified with the options **-d** or **\-\-data-output** and **-t** or **\-\-text-output**. Data output is only generated, if .data sections are used in the input *file*s.
de: Die Zieldateinamen sind standardmäßig **a.***ext* für Code- und **a.mem.***ext* für Datenausgaben. Die Pfade für diese Dateien können mittels den Optionen **-d** oder **\-\-data-output** und **-t** oder **\-\-text-output* verändert werden. Eine Datenausgabedatei wird nur dann erstellt, wenn .data Sektionen in einer der Eingabedateien (*file*s) verwendet wird.

source: OPTIONS
de: OPTIONEN

source: These options control the format, location and type of the output.
de: Diese Optionen legen das Format, den Speicherort und den Typ der Ausgabe fest.

source: : Specify the format of the output. The default is **mif**.
de: : Gibt das Format der Ausgabe an. Standardmäßig ist diese **mif**.

source: **raw** writes the machine code and data as binary to the output files.
de: **raw** schreibt den Maschinencode und die Daten binär in die Ausgabedateien.

source: **mif** writes and formats the machine code and data as MIF, see [src_mif(5)][] for details. The MIF format can be commented with the instruction assembly names using option **-c** or **\-\-comment**. The memory *depth* and word *width* can be changed using **\-\-depth** and **\-\-width** respectively.
de: **mif** schreibt und formatiert den Maschinencode und die Daten als MIF, siehe [src_mif(5)][] für Details. Jede Instruktion kann mithilfe der Option **-c** oder **\-\-comment** mit dessen Repräsentation in Assemblersyntax automatisch kommentiert werden. Die Anzahl der Speicheradressen (*depth*) und die Wortbreite (*width*) kann mithilfe der Optionen **\-\-depth** und **\-\-width** respektive verändert werden.

source: The format **dat** is similar to the format **mif**, but it only outputs the address with the associated data. Support for the option **-c** or **\-\-comment** is not implemented, but may come in the future.
de: Das Format **dat** ist ähnlich zu dem Format **mif** bis auf, dass die Ausgabe bei diesem Format nur die Adresse mit den dazugehörigen Daten beinhaltet. Die Option **-c** oder **\-\-comment** wird bis jetzt nicht unterstützt, jedoch ist die Unterstützung dieser Option geplant.

source: : Indicate that MIF output should be commented. By default MIF output is not commented. When used with **-f**=**mif** or **\-\-format**=**mif**, every machine code instruction includes a human readable representation as comment. Note that pseudo instructions or macros are not represented as such and only hardware instructions are used for representation in comments.
de: : Gibt an, dass die MIF-Ausgabe kommentiert werden soll. Standardmäßig ist die MIF-Ausgabe nicht kommentiert. Wenn sie mit **-f**=**mif** or **\-\-format**=**mif** verwendet wird, enthält jede Maschinencode-Anweisung eine lesbare Darstellung als Kommentar. Beachten Sie, dass Pseudoanweisungen oder Makros nicht als solche dargestellt werden und nur Anweisungen, die die Hardware implementiert, für die Darstellung in Kommentaren verwendet werden.

source: : Sets the memory *depth* for the MIF format. By default *depth* equals 1024. Valid values are between 1 and 65535 (including). See [src_mif(5)][] for details.
de: : Legt die Speicherlänge für das MIF-Format fest. Standardmäßig beträgt Speicherlänge (*depth*) 1024. Gültige Werte liegen zwischen 1 und 65535 (einschließlich). Siehe [src_mif(5)][] für Details.

source: : Sets the word *width* for the MIF format. By default *width* equals 32 (bit). See [src_mif(5)][] for details.
de: : Legt die Wortbreite (*width*) für das MIF-Format fest. Standardmäßig beträgt die Wortbreite (*width*) 32 (Bit). Siehe [src_mif(5)][] für Details.

source: : Write text output to *file* instead of the default location **a.***ext*. If **-f**=**mif** or **\-\-format**=**mif**, then *ext*=**mif**, otherwise *ext*=**bin**. Beware that this will override a file if it already exists!
de: : Schreibt die Code-Ausgabe nach *file* anstatt zu dem standardmäßigen Pfad **a.***ext*. Wenn **-f**=**mif** oder **\-\-format**=**mif**, dann ist *ext*=**mif**, ansonsten ist *ext*=**bin**. Beachten Sie, dass eine Datei, die an diesem Pfad existiert, überschrieben wird!

source: : Write data output to *file* instead of the default location **a.mem.***ext*. If **-f**=**mif** or **\-\-format**=**mif**, then *ext*=**mif**, otherwise *ext*=**bin**. Beware that this will override a file if it already exists!
de: : Schreibt die Daten-Ausgabe nach *file* anstatt zu dem standardmäßigen Pfad **a.mem.***ext*. Wenn **-f**=**mif** oder **\-\-format**=**mif**, dann ist *ext*=**mif**, ansonsten ist *ext*=**bin**. Beachten Sie, dass eine Datei, die an diesem Pfad existiert, überschrieben wird!

source: : Text and data output will be written to [stdout(3)][] when using this flag. This flag cannot be used with the options **-t**, **\-\-text-output**, **-d** or **\-\-data-output**.
de: : Die Code- und Daten-Ausgabe wird nach [stdout(3)][] geschrieben, wenn diese Flag genutzt wird. Diese Flag kann nicht mit den Optionen **-t**, **\-\-text-output**, **-d** oder **\-\-data-output** genutzt werden.

source: Note that the output will automatically be written to [stdout(3)][], if a pipe or redirection has been detected.
de: Beachten Sie, dass die Ausgabe automatisch nach [stdout(3)][] geschrieben wird, falls eine Pipe oder Umleitung von [stdout(3)][] festgestellt wurde.

source: These options control how the assembly code is assembled.
de: Diese Optionen legen fest, wie der Assemblercode zusammengesetzt wird.

source: : Indicate that no nop insertions should be done by the assembler. By default nop's are inserted to circumvent data, control and memory hazards. By using this flag, subroutines cannot be used since they contain hazards!
de: : Gibt an, dass keine NOP-Einfügungen durch den Assembler durchgeführt werden sollen. Standardmäßig werden NOPs eingefügt, um Probleme bei Daten-, Kontrollfluss- und Speicherabhängigkeiten zu umgehen. Durch Verwendung dieser Flag können Unterprogramme nicht verwendet werden, da diese Datenabhängigkeiten enthalten!

source: : By default the stack is initialized to 4096. This flag disallows stack initialization. Note that the stack must be initialized when using stack operations.
de: : Standardmäßig wird der Stack auf 4096 initialisiert. Diese Flag verhindert die Initialisierung des Stacks. Beachten Sie, dass der Stack initialisiert werden muss, wenn Stackoperationen verwendet werden.

source: Input option:
de: Eingabeoption:

source: : The list of input assembly files to use for assembling. At least one input file must be used. Multiple input files can be used and must be separated by a space.
de: : Die Liste der Eingabedateien für die Assemblierung. Mindestens eine Eingabedatei muss angegeben werden. Es können mehrere Eingabedateien angegeben werden, die durch ein Leerzeichen getrennt werden müssen.

source: The input files will be linked together in the order of specification in this option. The first file specified comes first, the last file specified comes last.
de: Die Eingabedateien werden in der Reihenfolge der Spezifikation in dieser Option verknüpft. Die zuerst angegebene Datei wird zuerst verarbeitet, die zuletzt angegebene Datei zuletzt.

source: Miscellaneous options:
de: Sonstige Optionen:

source: : Show help.
de: : Zeigt die verwendbaren Optionen an (show help).

source: : Show version and exit.
de: : Zeigt die Version an und beendet dann.

source: ENVIRONMENT
de: UMGEBUNG

source: : Used to set the log level for the assembler. Valid log levels are [**warn**|**error**|**info**|**debug**|**tracing**]. Different log levels for different modules may also be specified by using *module*=*log_level*. Only **debug** and below are used currently. Expect log output format to change. See <https://docs.rs/env_logger/0.11.1/env_logger/> for more information on logging.
de: : Wird verwendet, um das Protokollniveau für den Assembler festzulegen. Gültige Protokollniveaus sind [**warn**|**error**|**info**|**debug**|**tracing**]. Unterschiedliche Protokollniveaus für verschiedene Module können auch durch die Verwendung von *module*=*log_level* festgelegt werden. Derzeit werden nur **debug** und niedrigere Niveaus verwendet. Das Protokollformat kann sich jederzeit ändern. Weitere Informationen zur Protokollierung finden Sie unter <https://docs.rs/env_logger/0.11.1/env_logger/>.

source: EXIT STATUS
de: BEENDIGUNGSSTATUS

source: This section is WIP. Some operational errors will have different error codes. These are going to be documented here.
de: Dieser Abschnitt ist in Arbeit (Work in Progress, WIP). Einige Betriebsfehler haben andere Fehlercodes. Diese werden hier dokumentiert.

source: : Successful program execution.
de: : Erfolgreiche Programmausführung.

source: : General error.
de: : Allgemeiner Fehler.

source: : Generally indicates command line usage errors.
de: : Normalerweise wird dieser Fehlercode verwendet, um ein Fehler in den Nutzereingaben über die Argumente zu indizieren.

source: : Generally indicates a data format error in the input or output files.
de: : In der Regel wird dieser Fehlercode verwendet, um auf Fehler in der Formatierung der Eingabe oder Ausgabe hinzuweisen.

source: : Assembler could not create output file(s).
de: : Der Assembler konnte keine Ausgabedatei(en) erstellen.

source: EXAMPLES
de: BEISPIELE

source: Assemble one assembly file to output in MIF format:
de: Eine Assemblierung einer Assemblerdatei mit Ausgabe im MIF-Format:

source: $ assembler -i example.asm Assembled a.mif (/path/to/example) Finished [=========================================================] 5/5 Success
de: $ assembler -i example.asm Assembled a.mif (/pfad/zu/beispiel) Fertig [=========================================================] 5/5 Erfolg

source: Assemble more assembly files to output in binary format:
de: Mehrere Assemblerdateien assemblieren und in binären Format in einer Datei ausgeben:

source: $ assembler -i example.asm example2.asm example3.asm -f raw Assembled a.mif (/path/to/example) Finished [=========================================================] 5/5 Success
de: $ assembler -i example.asm example2.asm example3.asm -f raw Assembled a.mif (/pfad/zu/beispiel) Fertig [=========================================================] 5/5 Erfolg

source: Assemble one assembly file to output in MIF format, which is commented and uses 8 bit word width:
de: Eine Assemblerdatei assemblieren und im MIF-Format mit Kommentaren unter Verwendung einer Wortbreite von 8 Bit in eine Datei ausgeben:

source: $ assembler -i example.asm \-\-width 8 -c Assembled a.mif (/path/to/example) Finished [=========================================================] 5/5 Success
de: $ assembler -i example.asm \-\-width 8 -c Assembled a.mif (/pfad/zu/beispiel) Fertig [=========================================================] 5/5 Erfolg

source: Assemble one assembly file, view debug messages and write output to [stdout(3)][]:
de: Eine Assemblerdatei assemblieren, Debug-Nachrichten anzeigen und die Ausgabe nach [stdout(3)][] schreiben:

source: BUGS
de: FEHLER

source: COPYRIGHT
de: URHEBERRECHT

source: Copyright (c) 2023 Steven Becker
de: Urheberrecht (c) 2023 Steven Becker

source: This Source Code Form is subject to the terms of the Mozilla Public License, v. 2.0. If a copy of the MPL was not distributed with this file, You can obtain one at <http://mozilla.org/MPL/2.0/>.
de: Dieser Quellcode unterliegt den Bedingungen der Mozilla Public License, Version 2.0. Falls eine Kopie der MPL nicht mit dieser Datei verteilt wurde, können Sie eine unter <http://mozilla.org/MPL/2.0/> erhalten.

source: AUTHORS
de: AUTOREN

source: : Lead Maintainer
de: : Hauptverantwortlicher

source: SEE ALSO
de: SIEHE AUCH
